fonecmid-diplom/src/DataProcessors/ВКМ_УтверждениеГрафикаРаботы/ВКМ_УтверждениеГрафикаРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_УтверждениеГрафикаРаботы</name>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикРаботы/ВКМ_ГрафикРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикРаботы</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/DataProcessors/ВКМ_УтверждениеГрафикаРаботы/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		ЗаполнитьГрафикНаСервере();
		ОбщегоНазначенияКлиент.СообщитьПользователю("График работы записан.");
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьГрафикНаСервере()

	ТекущийДень = Объект.Период.ДатаНачала;
	
	Пока ТекущийДень <= Объект.Период.ДатаОкончания Цикл
		ОтметкаРабочегоДня = ПроверитьОтметкуРабочегоДня(ТекущийДень);
		
		НаборЗаписей = РегистрыСведений.ВКМ_ГрафикРаботы.СоздатьМенеджерЗаписи();
		НаборЗаписей.Дата = ТекущийДень;
		НаборЗаписей.ГрафикРаботы = Объект.График;
		НаборЗаписей.Значение = ОтметкаРабочегоДня;
		НаборЗаписей.Записать(Истина);
		
		ТекущийДень = ТекущийДень + 86400;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);	

КонецПроцедуры

&НаСервере
Функция ПроверитьОтметкуРабочегоДня(ТекущийДень)
	
	НомерДляНедели = ДеньНедели(ТекущийДень);
	
	Если НомерДляНедели = 1 Тогда
		ОтметкаРабочегоДня = ?(ДеньПонедельник, 1, 0);
	ИначеЕсли НомерДляНедели = 2 Тогда
		ОтметкаРабочегоДня = ?(ДеньВторник, 1, 0);
	ИначеЕсли НомерДляНедели = 3 Тогда
		ОтметкаРабочегоДня = ?(ДеньСреда, 1, 0);
	ИначеЕсли НомерДляНедели = 4 Тогда
		ОтметкаРабочегоДня = ?(ДеньЧетверг, 1, 0);
	ИначеЕсли НомерДляНедели = 5 Тогда
		ОтметкаРабочегоДня = ?(ДеньПятница, 1, 0);
	ИначеЕсли НомерДляНедели = 6 Тогда
		ОтметкаРабочегоДня = ?(ДеньСуббота, 1, 0);
	Иначе
		ОтметкаРабочегоДня = ?(ДеньВоскресенье, 1, 0);
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("Дата", ТекущийДень);
	РезультатПоиска = ПраздничныеДни.НайтиСтроки(ПараметрыОтбора);
	
	Если РезультатПоиска.Количество() = 0 Тогда
		Возврат ОтметкаРабочегоДня;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
